pulsating-flow-over-flexible-flap-3d/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: With OpenFOAM v1806 and OpenFOAM 6, the DyM solvers
// were marked deprecated and merged into their respective standard solvers.
application     pimpleFoam;    // OpenFOAM v1806, OpenFOAM 6, or newer
// application     pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older

libs ( "libgroovyBC.so" ) ;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.01;

writeControl    runTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   8;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}
